


IMAP Extensions Working Group                                   C. Daboo
Internet-Draft
Expires: May 25, 2006                                         R. Gellens
                                                   QUALCOMM Incorporated
                                                       November 21, 2005


                        IMAP ANNOTATE Extension
                     draft-ietf-imapext-annotate-14

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on May 25, 2006.

Copyright Notice

   Copyright (C) The Internet Society (2005).

Abstract

   The ANNOTATE extension to the Internet Message Access Protocol
   permits clients and servers to maintain "meta data" for messages, or
   individual message parts, stored in a mailbox on the server.

Change History (to be removed prior to publication as an RFC)

   Changes from -13 to -14:



Daboo & Gellens           Expires May 25, 2006                  [Page 1]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   1.   Changed 'string' formal syntax to 'list-mailbox' and 'astring'
        for entry/attribute names.
   2.   Updated examples to match new astring syntax.
   3.   Now requires explicit use of .priv or .shared in SORT.
   4.   Removed requirement that 'n' right only be present if 'r' right
        is also present.
   5.   Changed ANNOTATESIZE response to ANNOTATIONS response.
   6.   Allow servers to indicate that they do not support private
        annotations.
   7.   Added example for extended SELECT including ANNOTATIONS response
        code.
   8.   Removed content-type attribute.
   9.   Removed display-name attribute.
   10.  Prevent use of * and % wildcards in attributes.
   11.  Only allow "value" attributes in SEARCH.
   12.  Only allow "value" or "size" attributes in SORT.
   13.  Removed vendor attributes.
   14.  Removed IMAP flags, though the /flags entry path is reserved.
   15.  Added internationalization considerations.

   Changes from -12 to -13:
   1.   Sync with change from DC meeting wrt 'r' right for both read and
        write of .priv.
   2.   Add text about 'n' right being a 'shared flag right' as defined
        in 2086upd.
   3.   Allow NIL in /<section-part>/flags entries.
   4.   Expand abstract to also indicate that annotations can apply on a
        per-body part basis as well as per message.
   5.   Fix resp-text-code to use nil instead of "NIL".
   6.   Use double-quotes consistently around ANNOTATESIZE etc.
   7.   Fix typos.
   8.   Remove redundant second para of Introduction.
   9.   Added 'Conventions' section with RFC2119 reference..
   10.  Describe S:, C: example behaviour in conventions section..
   11.  Clarify that new rights must also be present if only old ACL is
        present.
   12.  Entry/attributes MUST NOT contain consecutive or trailing '/' or
        '.'.
   13.  Clarify default charset for content-type text/plain.
   14.  Recommend use of utf-8 for all non-ascii text.
   15.  Clarify terminology of ANNOTATESIZE response code.
   16.  Require servers to return ANNOTATESIZE on SELECT.
   17.  Change an example to use UID FETCH for variety.
   18.  Clarify what to do about annotations exceeding allowed
        ANNOTATESIZE when doing copy.
   19.  Use ABNFext document for extended SELECT etc.





Daboo & Gellens           Expires May 25, 2006                  [Page 2]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   20.  Remove RFC1891 reference.
   21.  capability syntax extension.
   22.  Comment on validation content-type attribute.
   23.  Added recommended content-type in IANA registration.
   24.  Added use of literal8 for values.
   25.  Prevent use of 'shared' and 'priv' as separate hierarchy
        components.
   26.  Restrict entry/attribute names to ascii and added display-name
        attribute.
   27.  Remove references to CATENATE and use ABNFext for extended
        APPEND syntax.

   Changes from -11 to -12:
   1.  Fixed raw XML in formal syntax.
   2.  Fixed double \ in IANA section titles.
   3.  Fixed APPEND formal syntax.
   4.  Added annotations to CATENATE extension.
   5.  Reworded text for unsolicited responses.
   6.  Fixed formal syntax for fetch responses to extend base spec item.

   Changes from -10 to -11:
   1.  Flags are now read-only and exactly match their IMAP
       counterparts.
   2.  Added new ACL bits for annotations.
   3.  Revise security considerations.
   4.  Fixed some references.

   Changes from -09 to -10:
   1.  Added Content-Language value.
   2.  Added IANA registrations for entries/attributes in this document.

   Changes from -08 to -09:
   1.  Fix formatting, ID nits etc.
   2.  Fix subject -> altsubject in examples.
   3.  Added text to SELECT/EXAMINE optional parameter definition to
       indicate that the option could trigger a global state change or a
       mailbox specific change.
   4.  Changed entry/attribute names to be case-sensitive to avoid case
       mapping issues with utf8 text.
   5.  Clarify COPY interaction to indicate that only the current user's
       '.priv's are copied, not the '.priv's of other users.

   Changes from -07 to -08:
   1.  ANNOTATESIZE response changed to use "NIL" for a mailbox that
       does not support any type of annotations, and "0" for a mailbox
       that only supports read-only annotations.

   Changes from -06 to -07:



Daboo & Gellens           Expires May 25, 2006                  [Page 3]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   1.  Added text to state entry and attribute names are always case-
       insensitive.
   2.  Removed top-level entry namespace.
   3.  Added server accept minima for annotation size and count.
   4.  Added [ANNOTATE TOOBIG] & [ANNOTATE TOOMANY] response codes.
   5.  Added [ANNOTATESIZE <<n>>] response code.
   6.  Added comment on suggested CONDSTORE support.
   7.  Modified append behaviour to account for MULTIAPPEND.
   8.  Tweaked ABNF.

   Changes from -05 to -06:
   1.  Split references into Normative and Informative.
   2.  Reworked flags to allow IMAP4 flag prefix to appear in annotation
       name.
   3.  Removed smtp-envelope annotation - a future extension can add
       this.
   4.  Changed subject to altsubject.
   5.  Added $MDNSent flag and reference to document.
   6.  Cleaned up formal syntax to use IMAP string type for entry and
       attributes, with requirements on how the string is formatted.
   7.  Use of ACAP vendor subtree registry for vendor tokens.
   8.  Fixed STORE syntax.

   Changes from -04 to -05:
   1.  Fixed examples to match formal syntax for FETCH responses where
       parenthesis do not appear around entry-att items.

   Changes from -03 to -04:
   1.  Fixed attrib/attrib-match grammar to use "." instead of "/".
   2.  Add text for server to reject unknown <part-specifier>.
   3.  Do not allow empty part-specifier.
   4.  Store NIL to value to delete.
   5.  Comment on COPY interaction with ANNOTATE.
   6.  Added comment that IMAP flags are mapped one-to-one with their
       corresponding FLAGS items.
   7.  Added comment that the recent flag annotation is read-only.

   Changes from -02 to -03:
   1.  Removed reference to status modtime item.
   2.  Added missing 'notify' and 'ret' dsn annotations for /message/
       smtp-envelope.
   3.  Added requirement to store data permanently - no 'session only'
       annotations.
   4.  Removed Access Control section.  Replaced with comments on read-
       only/read-write mailboxes and storing private or shared
       annotations.





Daboo & Gellens           Expires May 25, 2006                  [Page 4]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   5.  Removed STORE to default .priv or .shared.
   6.  Added section on optional select parameters.

   Changes from -01 to -02:
   1.  Now require .priv or .shared on store operations.

   Changes from -00 to -01:
   1.  MODTIME moved to its own draft, which this draft now depends on.
       Thus, Conditional Annotation STORE and related items deleted from
       this draft.
   2.  Private versus Shared Annotations: both are possible (separately
       addressable using ".priv" and ".shared" suffixes).  There is a
       per-mailbox setting for the default.  It is an open issue how
       this is viewed or changed by the client.
   3.  In ACLs, the "w" right is needed to updated shared state; the "s"
       right is needed to update private state.
   4.  Various clarifications and text modifications.
   5.  Added 'forwarded' flag for message parts.

   Changes from pre-imapext to -00:
   1.   Clarified text describing attributions, entries, and attributes.
   2.   Changed 'modifiedsince' to 'modtime'; referenced ACAP spec.
   3.   Deleted 'queued' flag.
   4.   Expanded and explained smtp-envelope entry.
   5.   Restricted including ANNOTATION data in unsolicited responses
        until the client uses it first.  (Open issue as to if needed).
   6.   Examples now only use valid entries and attributes.
   7.   Updated Security Considerations.
   8.   Content-Type now defaults to text/plain.
   9.   Open Issue: Shared vs. private annotations.
   10.  Open issue: Annotation Modtime untagged response or VALIDTIME
        FETCH data.
   11.  Open issue: Conditional annotation STORE.
   12.  ANNOTATION criterion available if both "ANNOTATE" and "SORT" in
        CAPABILITY command response.
   13.  Prohibition on annotations in lieu of base spec functionality.
   14.  Specified required ACL rights.
   15.  ANNOTATION message data item in APPEND.
   16.  ANNOTATION-MODTIME message data item in STATUS.
   17.  Replaced ATOM_CHAR with utf8-char.
   18.  Updated other ABNF entries.










Daboo & Gellens           Expires May 25, 2006                  [Page 5]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


Table of Contents

   1.  Introduction and Overview  . . . . . . . . . . . . . . . . . .  7
   2.  Conventions Used in This Document  . . . . . . . . . . . . . .  7
   3.  Data Model . . . . . . . . . . . . . . . . . . . . . . . . . .  8
     3.1.  Overview . . . . . . . . . . . . . . . . . . . . . . . . .  8
     3.2.  Namespace of entries and attributes  . . . . . . . . . . .  8
       3.2.1.  Entry Names  . . . . . . . . . . . . . . . . . . . . .  9
       3.2.2.  Attribute Names  . . . . . . . . . . . . . . . . . . . 10
     3.3.  Private versus Shared  . . . . . . . . . . . . . . . . . . 11
     3.4.  Access Control . . . . . . . . . . . . . . . . . . . . . . 12
     3.5.  Access to Standard IMAP Flags and Keywords . . . . . . . . 15
   4.  IMAP Protocol Changes  . . . . . . . . . . . . . . . . . . . . 15
     4.1.  General Considerations . . . . . . . . . . . . . . . . . . 15
     4.2.  ANNOTATE parameter with the SELECT/EXAMINE commands  . . . 16
     4.3.  ANNOTATION Message Data Item in FETCH Command  . . . . . . 16
     4.4.  ANNOTATION Message Data Item in FETCH Response . . . . . . 18
     4.5.  ANNOTATION Message Data Item in STORE  . . . . . . . . . . 20
     4.6.  ANNOTATION interaction with COPY . . . . . . . . . . . . . 21
     4.7.  ANNOTATION Message Data Item in APPEND . . . . . . . . . . 22
     4.8.  ANNOTATION Criterion in SEARCH . . . . . . . . . . . . . . 22
     4.9.  ANNOTATION Key in SORT . . . . . . . . . . . . . . . . . . 23
     4.10. New ACL Rights . . . . . . . . . . . . . . . . . . . . . . 24
   5.  Formal Syntax  . . . . . . . . . . . . . . . . . . . . . . . . 24
   6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 26
     6.1.  Entry and Attribute Registration Template  . . . . . . . . 26
     6.2.  Entry Registrations  . . . . . . . . . . . . . . . . . . . 27
       6.2.1.  /comment . . . . . . . . . . . . . . . . . . . . . . . 27
       6.2.2.  /flags . . . . . . . . . . . . . . . . . . . . . . . . 27
       6.2.3.  /altsubject  . . . . . . . . . . . . . . . . . . . . . 28
       6.2.4.  /<section-part>/comment  . . . . . . . . . . . . . . . 28
       6.2.5.  /<section-part>/flags/seen . . . . . . . . . . . . . . 29
       6.2.6.  /<section-part>/flags/answered . . . . . . . . . . . . 29
       6.2.7.  /<section-part>/flags/flagged  . . . . . . . . . . . . 30
       6.2.8.  /<section-part>/flags/forwarded  . . . . . . . . . . . 30
     6.3.  Attribute Registrations  . . . . . . . . . . . . . . . . . 30
       6.3.1.  value  . . . . . . . . . . . . . . . . . . . . . . . . 31
       6.3.2.  size . . . . . . . . . . . . . . . . . . . . . . . . . 31
       6.3.3.  content-language . . . . . . . . . . . . . . . . . . . 32
   7.  Internationalization Considerations  . . . . . . . . . . . . . 32
   8.  Security Considerations  . . . . . . . . . . . . . . . . . . . 32
   9.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 32
     9.1.  Normative References . . . . . . . . . . . . . . . . . . . 32
     9.2.  Informative References . . . . . . . . . . . . . . . . . . 33
   Appendix A.  Acknowledgments . . . . . . . . . . . . . . . . . . . 33
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 34
   Intellectual Property and Copyright Statements . . . . . . . . . . 35




Daboo & Gellens           Expires May 25, 2006                  [Page 6]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


1.  Introduction and Overview

   The ANNOTATE extension is present in any IMAP [RFC3501]
   implementation which returns "ANNOTATE" as one of the supported
   capabilities in the CAPABILITY response.

   This extension makes the following changes to the IMAP protocol:

   a.  adds a new ANNOTATION message data item for use in FETCH
   b.  adds a new ANNOTATION message data item for use in STORE
   c.  adds a new ANNOTATION search criterion for use in SEARCH
   d.  adds a new ANNOTATION sort key for use in SORT extension
   e.  adds a new ANNOTATION data item for use in APPEND
   f.  adds a new requirement on the COPY command
   g.  adds a new ANNOTATE parameter for use with the SELECT/EXAMINE
       commands
   h.  adds two new response codes to indicate store failures of
       annotations.
   i.  adds a new untagged response code for the SELECT or EXAMINE
       commands to indicate the maximum size.
   j.  adds a new ACL "bit" for use with the ACL extensions [RFC2086]
       and [I-D.ietf-imapext-2086upd] .

   The data model used for the storage of annotations is based on that
   of the Application Configuration Access Protocol [RFC2244].  Note
   that there is no inheritance in annotations.

   If a server supports annotations, then it MUST store all annotation
   data permanently, i.e. there is no concept of "session only"
   annotations that would correspond to the behaviour of "session" flags
   as defined in the IMAP base specification.

   In order to provide optimum support for a disconnected client (one
   that needs to synchronise annotations for use when offline), servers
   SHOULD also support the Conditional STORE [I-D.ietf-imapext-
   condstore] extension.

   The rest of this document describes the data model and protocol
   changes more rigorously.


2.  Conventions Used in This Document

   In examples, "C:" and "S:" indicate lines sent by the client and
   server respectively.

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this



Daboo & Gellens           Expires May 25, 2006                  [Page 7]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   document are to be interpreted as described in [RFC2119].


3.  Data Model

3.1.  Overview

   The data model used in ANNOTATE is that of a uniquely named entry
   which contains a set of standard attributes.  A single coherent unit
   of "meta data" for a message is stored as a single entry, made up of
   several attributes.

   For example, a comment annotation added to a message has an entry
   name of "/comment".  This entry is composed of several attributes
   such as "value", "size", etc. which contain the properties and data
   of the entry.

   The protocol changes to IMAP described below allow a client to access
   or change the values of any attributes in any entries in a message
   annotation, assuming it has sufficient access rights to do so (see
   Section 3.4 for specifics).

3.2.  Namespace of entries and attributes

   Each message annotation is made up of a set of entries.  Each entry
   has a hierarchical name, with each component of the name separated by
   a slash ("/").  An entry name MUST NOT contain two consecutive "/"
   characters and MUST NOT end with a "/" character.

   Each entry is made up of a set of attributes.  Each attribute has a
   hierarchical name, with each component of the name separated by a
   period (".").  An attribute name MUST NOT contain two consecutive "."
   characters and MUST NOT end with a "." character.

   The value of an attribute is "NIL" (has no value), or is a string of
   zero or more octets.

   Entry and attribute names MUST NOT contain asterisk ("*") or percent
   ("%") characters and MUST NOT contain non-ASCII characters or the
   NULL octet.  Invalid entry or attribute names result in a BAD
   response in any IMAP commands where they are used.

   Attribute names MUST NOT contain any hierarchical components with the
   names "priv" or "shared" as those have special meaning (see
   Section 3.3.

   Entry and attribute names are case-sensitive.




Daboo & Gellens           Expires May 25, 2006                  [Page 8]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   Use of control or punctuation characters in entry and attribute names
   is strongly discouraged.

   This specification defines an initial set of entry and attribute
   names available for use in message annotations.  In addition, an
   extension mechanism is described to allow additional names to be
   added as needed.

3.2.1.  Entry Names

   Entry names MUST be specified in a standards track or IESG approved
   experimental RFC, or fall under the vendor namespace.  See
   Section 6.1 for the registration template.

   /
      Defines the top-level of entries associated with an entire
      message.  This entry itself does not contain any attributes.  All
      entries that start with a numeric character ("0" - "9") refer to
      an annotation on a specific body part.  All other entries are for
      annotations on the entire message.

   /comment
      Defines a comment or note associated with an entire message.

   /flags
      This entry hierarchy is reserved for future use.

   /altsubject
      Contains text supplied by the message recipient, to be used by the
      client instead of the original message Subject.

   /vendor/<vendor-token>
      Defines the top-level of entries associated with an entire message
      as created by a particular product of some vendor.  These sub-
      entries can be used by vendors to provide client-specific
      annotations.  The vendor-token MUST be registered with IANA, using
      the [RFC2244] vendor subtree registry.

   /<section-part>
      Defines the top-level of entries associated with a specific body
      part of a message.  This entry itself does not contain any
      attributes.  The section-part uses the same numeric part specifier
      syntax as the BODY message data item in the FETCH command
      [RFC3501].  The server MUST return a BAD response if the client
      uses an incorrect part specifier (either incorrect syntax or a
      specifier referring to a non-existent part).  The server MUST
      return a BAD response if the client uses an empty part specifier
      (which is used in IMAP to represent the entire message).



Daboo & Gellens           Expires May 25, 2006                  [Page 9]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   /<section-part>/comment
      Defines a comment or note associated with a specific body part of
      a message.

   /<section-part>/flags
      Defines the top-level of entries associated with flag state for a
      specific body part of a message.  All sub-entries are maintained
      entirely by the client.  There is no implicit change to any flag
      by the server.

         /<section-part>/flags/seen
         /<section-part>/flags/answered
         /<section-part>/flags/flagged
         /<section-part>/flags/forwarded

      Defines flags for a specific body part of a message.  The "value"
      attribute of each of the entries described above must be either
      "1", "0" or "NIL". "1" corresponds to the flag being set.

   /<section-part>/vendor/<vendor-token>
      Defines the top-level of entries associated with a specific body
      part of a message as created by a particular product of some
      vendor.  This entry can be used by vendors to provide client
      specific annotations.  The vendor-token MUST be registered with
      IANA.

3.2.2.  Attribute Names

   Attribute names MUST be specified in a standards track or IESG
   approved experimental RFC.  See Section 6.1 for the registration
   template.

   All attribute names implicitly have a ".priv" and a ".shared" suffix
   which maps to private and shared versions of the entry.  Searching or
   fetching without using either suffix includes both.  The client MUST
   specify either a ".priv" or ".shared" suffix when storing an
   annotation.

   value
      A string or binary data representing the value of the annotation.
      To delete an annotation, the client can store "NIL" into the
      value.  The content represented by the string is determined by the
      Content-type used to register the entry (see Section 6.1 for entry
      registration templates).  Where applicable, the registered
      content-type MUST include a charset parameter.  Text values SHOULD
      use the utf-8 [RFC3629] character set.





Daboo & Gellens           Expires May 25, 2006                 [Page 10]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


      Note that binary data (data which may contain the NULL octet) is
      allowed (e.g. for storing images etc), and this extension uses the
      "literal8" syntax element [I-D.melnikov-imap-ext-abnf] to allow
      such data to be written to or read from the server.

   size
      The size of the value, in octets.  Set automatically by the
      server, read-only to clients.

   content-language
      Indicates the language used for the value.  This follows the
      format described in [RFC3282].  Clients SHOULD set this value when
      storing an annotation that uses text that can be presented to the
      user.  It is not required for enumerated or numeric values such as
      flags etc.  If a value is being set, clients MUST ensure that it
      accurately reflects the content stored in the value attribute.
      Servers MUST ensure that the "content-language" attribute value is
      kept in synchronization with the "value" attribute.  To ensure
      that, the server MUST remove any "content-language" attribute
      value when the client STOREs a "value" attribute without also
      including a "content-language" attribute in the same STORE
      command.

3.3.  Private versus Shared

   Some IMAP mailboxes are private, accessible only to the owning user.
   Other mailboxes are not, either because the owner has set an ACL
   [I-D.ietf-imapext-2086upd] which permits access by other users, or
   because it is a shared mailbox.

   This raises the issue of shared versus private annotations.

   If all annotations are private, it is impossible to set annotations
   in a shared or otherwise non-private mailbox that are visible to
   other users.  This eliminates what could be a useful aspect of
   annotations in a shared environment.  An example of such use is a
   shared IMAP folder containing bug reports.  Engineers may want to use
   annotations to add information to existing messages, indicate
   assignments, status, etc.  This use requires shared annotations.

   If all annotations are shared, it is impossible to use annotations
   for private notes on messages in shared mailboxes.  Also, modifying
   an ACL to permit access to a mailbox by other users may
   unintentionally expose private information.

   There are also situations in which both shared and private
   annotations are useful.  For example, an administrator may want to
   set shared annotations on messages in a shared folder, which



Daboo & Gellens           Expires May 25, 2006                 [Page 11]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   individual users may wish to supplement with additional notes.

   If shared and private annotations are to coexist, we need a clear way
   to differentiate them.  Also, it should be as easy as possible for a
   client to access both and not overlook either.  There is also a
   danger in allowing a client to store an annotation without knowing if
   it is shared or private.

   This document proposes two standard suffixes for all attributes:
   ".shared" and ".priv".  A SEARCH or FETCH command which specifies
   neither uses both.  STORE, APPEND and SORT commands MUST explicitly
   use ".priv" or ".shared" suffixes.

   If the ANNOTATE extension is present, support for shared annotations
   in servers is REQUIRED, whilst support for private annotations in
   servers is OPTIONAL.  This recognises the fact that support for
   private annotations may introduce significantly more complexity to a
   server in terms of tracking ownership of the annotations, how quota
   is determined for users based on their own annotations etc.  Clients
   that support the ANNOTATE extension MUST handle both shared and
   private annotations.

3.4.  Access Control

   A user needs to have appropriate rights in order to read or write
   ".priv" or ".shared" annotation values.  How those rights are
   calculated depends on whether the ACL [RFC2086] extension or its
   update [I-D.ietf-imapext-2086upd] is present or not.  If a client
   attempts to store or fetch an annotation to which they do not have
   the appropriate rights, the server MUST respond with a NO response.

   When the ACL extension is not present, access to annotation values is
   governed by the nature of the selected state.  In particular whether
   the mailbox was SELECT'ed or EXAMINE'd in READ-ONLY or READ-WRITE
   mode.

   When the ACL extension is present, the server MUST recognise the new
   ACL right "n", in addition to the ones defined by the ACL extension
   itself.

   The "r" right controls both read and write access to ".priv"
   annotation values.  When it is on, access to ".priv" annotations is
   allowed, when it is off, access to ".priv" annotations is disallowed.

   The "r" right controls only the read access for ".shared" annotation
   values.  When it is on, ".shared" annotations can be read, when it is
   off, ".shared" annotations cannot be read.




Daboo & Gellens           Expires May 25, 2006                 [Page 12]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   The "n" right controls only the write access for ".shared" annotation
   values.  When it is on, ".shared" annotations can be changed or
   created through either a STORE or APPEND command, when it is off,
   ".shared" annotations cannot be changed or created.  The "n" right
   constitutes a "shared flag right" as defined in [I-D.ietf-imapext-
   2086upd] Section 6.2.

















   A summary of all the access control restrictions is tabulated below



























Daboo & Gellens           Expires May 25, 2006                 [Page 13]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   +---------------+---------------+-----------------------------------+
   |  Server Type  | Action on     | Type of mailbox                   |
   |               | annotation    |                                   |
   +===============+===============+===================================+
   |               |               |                                   |
   |               | read .priv    | Any mailbox that can be SELECTED  |
   |               | values        | or EXAMINED.                      |
   |               |               |                                   |
   |               +---------------+-----------------------------------+
   |               |               |                                   |
   |               | write .priv   | Any SELECTED [READ-WRITE] mailbox.|
   |               | values        | SELECTED [READ-ONLY] mailboxes MAY|
   | Server        |               | also permit writes.               |
   | without       |               |                                   |
   | ACL Extension +---------------+-----------------------------------+
   |               |               |                                   |
   |               | read .shared  | Any mailbox that can be SELECTED  |
   |               | values        | or EXAMINED.                      |
   |               |               |                                   |
   |               +---------------+-----------------------------------+
   |               |               |                                   |
   |               | write .shared | Any mailbox that can be SELECTED  |
   |               | values        | or EXAMINED and is [READ-WRITE].  |
   |               |               |                                   |
   +---------------+---------------+-----------------------------------+
   |               |               |                                   |
   |               | read .priv    | Any mailbox with the "r"          |
   |               | values        | ACL right.                        |
   |               |               |                                   |
   |               +---------------+-----------------------------------+
   |               |               |                                   |
   |               | write .priv   | Any mailbox with the "r"          |
   | Server        | values        | ACL right.                        |
   | with          |               |                                   |
   | ACL Extension +---------------+-----------------------------------+
   |               |               |                                   |
   |               | read .shared  | Any mailbox with the "r"          |
   |               | values        | ACL right.                        |
   |               |               |                                   |
   |               +---------------+-----------------------------------+
   |               |               |                                   |
   |               | write .shared | Any mailbox with the "n"          |
   |               | values        | ACL right.                        |
   |               |               |                                   |
   +---------------+---------------+-----------------------------------+






Daboo & Gellens           Expires May 25, 2006                 [Page 14]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


3.5.  Access to Standard IMAP Flags and Keywords

   Due to ambiguity of how private and shared values would map to the
   base IMAP flag and keyword values, the ANNOTATE extension does not
   expose IMAP flags or keywords as entries.  However, the /flags
   annotation entry is reserved for future use and MUST NOT be used by
   clients or servers supporting this extension.

   Clients that need to implement shared and private "flags" can create
   their own annotation entries for those, completely bypassing the base
   IMAP flag/keyword behaviour.


4.  IMAP Protocol Changes

4.1.  General Considerations

   Servers may be able to offer only a limited level of support for
   annotations in mailboxes, and it is useful for clients to be able to
   know what level of support is available.  Servers MUST return an
   ANNOTATIONS response during the SELECT or EXAMINE command for a
   mailbox to indicate the level of support.  Possible response codes
   used with the ANNOTATIONS response are:

      "NONE" - this indicates that the mailbox being selected does not
      support annotations at all.  Clients MUST NOT attempt to use
      annotation extensions in commands.

      "READ-ONLY" - this indicates that the annotations supported by the
      mailbox cannot be changed by the client.  Clients MUST NOT attempt
      to store annotations on any messages in a mailbox with this
      response code.

      "NOPRIVATE" - this indicates that the server does not support
      private annotations on the mailbox.  Only shared annotations are
      supported.  Clients SHOULD only attempt to read or store
      annotations attributes with the ".shared" suffix.  If a client
      uses an attribute with the ".priv" suffix in a FETCH command, then
      servers should return the attribute value in the FETCH response as
      "NIL".  If a client uses an attribute with the ".priv" suffix in a
      STORE command (or an APPEND command targetted at the mailbox) then
      the server MUST return a NO response.

      numeric values - if servers support writable annotations, then the
      server MUST indicate the maximum size for an annotation value by
      providing the maximum size value in the response code.  Clients
      MUST NOT store annotation values of a size greater than the amount
      indicated by the server.  Servers MUST accept a minimum annotation



Daboo & Gellens           Expires May 25, 2006                 [Page 15]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


      data size of at least 1024 bytes if annotations can be written.

   In addition the server MAY limit the total number of annotations for
   a single message.  However, the server MUST provide a minimum
   annotation count per message of at least 10.

4.2.  ANNOTATE parameter with the SELECT/EXAMINE commands

   The ANNOTATE extension defines a single optional SELECT parameter
   [I-D.melnikov-imap-ext-abnf] "ANNOTATE", which is used to turn on
   unsolicited responses for annotations as described in Section 4.4.
   This optional parameter results in a per-mailbox state change, i.e.
   it must be used in each SELECT/EXAMINE command in order to be
   effective, irrespective of whether it was used in a previous SELECT/
   EXAMINE during the same session.

   Example:

           C: a SELECT INBOX ANNOTATE
           S: * FLAGS (\Answered \Flagged \Draft \Deleted \Seen)
           S: * OK [PERMANENTFLAGS (\Answered \Flagged \Draft
                                             \Deleted \Seen \*)]
           S: * 10268 EXISTS
           S: * 1 RECENT
           S: * OK [UNSEEN 10268]
           S: * OK [UIDVALIDITY 890061587]
           S: * OK [UIDNEXT 34643]
           S: * OK [ANNOTATIONS 20480 NOPRIVATE]
           S: a OK [READ-WRITE] Completed

      In the above example, a SELECT command with the ANNOTATE parameter
      is issued.  The response from the server includes the required
      ANNOTATIONS response that indicates that the server supports
      annotations up to a maximum size of 20480 bytes and does not
      support private annotations (only shared).

4.3.  ANNOTATION Message Data Item in FETCH Command

   This extension adds an ANNOTATION message data item to the FETCH
   command.  This allows clients to retrieve annotations for a range of
   messages in the currently selected mailbox.

   ANNOTATION <entry-specifier> <attribute-specifier>

      The ANNOTATION message data item, when used by the client in the
      FETCH command, takes an entry specifier and an attribute
      specifier.




Daboo & Gellens           Expires May 25, 2006                 [Page 16]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   Example:

           C: a FETCH 1 (ANNOTATION (/comment value))
           S: * 1 FETCH (ANNOTATION (/comment
                                       (value.priv "My comment"
                                        value.shared "Group note")))
           S: a OK Fetch complete

      In the above example, the content of the "value" attribute for the
      "/comment" entry is requested by the client and returned by the
      server.  Since neither ".shared" nor ".priv" was specified, both
      are returned.

   "*" and "%" wild card characters can be used in entry specifiers to
   match one or more characters at that position, with the exception
   that "%" does not match the "/" hierarchy delimiter.  Thus an entry
   specifier of "/%" matches entries such as "/comment" and
   "/altsubject", but not "/1/comment".

   Example:

           C: a UID FETCH 1123 (UID ANNOTATION
                                (/* (value.priv size.priv)))
           S: * 12 FETCH (UID 1123 ANNOTATION
                  (/comment (value.priv "My comment"
                                       size.priv "10")
                   /altsubject (value.priv "Rhinoceroses!"
                                       size.priv "13")
                   /vendor/foobar/label.priv
                                       (value.priv "label43"
                                        size.priv "7")
                   /vendor/foobar/personality
                                       (value.priv "Tallulah Bankhead"
                                        size.priv "17")))
           S: a OK Fetch complete

      In the above example, the contents of the private "value" and
      "size" attributes for any entries in the "/" hierarchy are
      requested by the client and returned by the server.

   Example:

           C: a FETCH 1 (ANNOTATION (/% value.shared))
           S: * 1 FETCH (ANNOTATION
              (/comment (value.shared "Patch Mangler")
               /altsubject (value.shared "Patches?  We don't
               need no steenkin patches!")))
           S: a OK Fetch complete



Daboo & Gellens           Expires May 25, 2006                 [Page 17]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


      In the above example, the contents of the shared "value"
      attributes for entries at the top level only of the "/" hierarchy
      are requested by the client and returned by the server.

   Entry and attribute specifiers can be lists of atomic specifiers, so
   that multiple items of each type may be returned in a single FETCH
   command.

   Example:

           C: a FETCH 1 (ANNOTATION
                ((/comment /altsubject) value.priv))
           S: * 1 FETCH (ANNOTATION
                (/comment (value.priv "What a chowder-head")
                 /altsubject (value.priv "How to crush beer cans")))
           S: a OK Fetch complete

      In the above example, the contents of the private "value"
      attributes for the two entries "/comment" and "/altsubject" are
      requested by the client and returned by the server.

4.4.  ANNOTATION Message Data Item in FETCH Response

   The ANNOTATION message data item in the FETCH response displays
   information about annotations in a message.

   ANNOTATION parenthesised list

      The response consists of a list of entries, each of which has a
      list of attribute-value pairs.

   Example:

           C: a FETCH 1 (ANNOTATION (/comment value))
           S: * 1 FETCH (ANNOTATION (/comment
                                      (value.priv "My comment"
                                       value.shared NIL)))
           S: a OK Fetch complete

      In the above example, a single entry with a single attribute-value
      pair is returned by the server.  Since the client did not specify
      a ".shared" or ".priv" suffix, both are returned.  Only the
      private attribute has a value (the shared value is "NIL").

   Example:






Daboo & Gellens           Expires May 25, 2006                 [Page 18]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


           C: a FETCH 1 (ANNOTATION
                ((/comment /altsubject) value))
           S: * 1 FETCH (ANNOTATION
                (/comment (value.priv "My comment"
                                     value.shared NIL)
                 /altsubject (value.priv "My subject"
                                     value.shared NIL)))
           S: a OK Fetch complete

      In the above example, two entries each with a single attribute-
      value pair are returned by the server.  Since the client did not
      specify a ".shared" or ".priv" suffix, both are returned.  Only
      the private attributes have values; the shared attributes are
      "NIL".

   Example:

           C: a FETCH 1 (ANNOTATION
                           (/comment (value size)))
           S: * 1 FETCH (ANNOTATION
                           (/comment
                               (value.priv "My comment"
                                value.shared NIL
                                size.priv "10"
                                size.shared "0")))
           S: a OK Fetch complete

      In the above example, a single entry with two attribute-value
      pairs is returned by the server.  Since the client did not specify
      a ".shared" or ".priv" suffix, both are returned.  Only the
      private attributes have values; the shared attributes are "NIL".

   Servers SHOULD send ANNOTATION message data items in unsolicited
   FETCH responses if an annotation entry is changed by a third-party,
   and the ANNOTATE select parameter was used.  This allows servers to
   keep clients updated with changes to annotations by other clients.

   Unsolicited ANNOTATION responses MUST NOT include ANNOTATION data
   values - only the entry name of the ANNOTATION that has changed.
   This restriction avoids sending ANNOTATION data values (which may be
   large) to a client unless the client explicitly asks for the value.

   Example:

           C: a STORE 1 +FLAGS (\Seen)
           S: * 1 FETCH (FLAGS (\Seen))
                         ANNOTATION (/comment))
           S: a OK STORE complete



Daboo & Gellens           Expires May 25, 2006                 [Page 19]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


      In the above example, an unsolicited ANNOTATION response is
      returned during a STORE command.  The unsolicited response
      contains only the entry name of the annotation that changed, and
      not its value.

4.5.  ANNOTATION Message Data Item in STORE

   ANNOTATION <parenthesised entry-attribute-value list>

      Sets the specified list of entries by adding or replacing the
      specified attributes with the values provided.  Clients can use
      "NIL" for values of attributes it wants to remove from entries.

   The ANNOTATION message data item used with the STORE command has an
   implicit ".SILENT" behaviour.  This means the server does not
   generate an untagged FETCH in response to the STORE command and
   assumes that the client updates its own cache if the command
   succeeds.

   If the server is unable to store an annotation because the size of
   its value is too large, the server MUST return a tagged NO response
   with a "[ANNOTATE TOOBIG]" response code.

   If the server is unable to store a new annotation because the maximum
   number of allowed annotations has already been reached, the server
   MUST return a tagged NO response with a "[ANNOTATE TOOMANY]" response
   code.

   Example:

           C: a STORE 1 ANNOTATION (/comment
                                    (value.priv "My new comment"))
           S: a OK Store complete

      In the above example, the entry "/comment" is created (if not
      already present) and the private attribute "value" with data set
      to "My new comment" is created if not already present, or replaced
      if it exists.

   Example:

           C: a STORE 1 ANNOTATION (/comment
                                       (value.shared NIL))
           S: a OK Store complete

      In the above example, the shared "value" attribute of the entry
      "/comment" is removed by storing "NIL" into the attribute.




Daboo & Gellens           Expires May 25, 2006                 [Page 20]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   Multiple entries can be set in a single STORE command by listing
   entry-attribute-value pairs in the list.

   Example:

           C: a STORE 1 ANNOTATION (/comment
                                    (value.priv "Get tix Tuesday")
                                    /altsubject
                                    (value.priv "Wots On"))
           S: a OK Store complete

      In the above example, the entries "/comment" and "/altsubject" are
      created (if not already present) and the private attribute "value"
      is created for each entry if not already present, or replaced if
      they exist.

   Multiple attributes can be set in a single STORE command by listing
   multiple attribute-value pairs in the entry list.

   Example:

           C: a STORE 1 ANNOTATION (/comment
                                    (value.priv "My new comment"
                                     value.shared "foo's bar"))
           S: a OK Store complete

   In the above example, the entry "/comment" is created (if not already
   present) and the private and shared "value" attributes are created if
   not already present, or replaced if they exist.

4.6.  ANNOTATION interaction with COPY

   The COPY command can be used to move messages from one mailbox to
   another on the same server.  Servers that support the ANNOTATION
   extension MUST, for each message being copied, copy all ".priv"
   annotation data for the current user only, and all ".shared"
   annotation data along with the message to the new mailbox.  The only
   exceptions to this are if the destination mailbox permissions are
   such that either the ".priv" or ".shared" annotations are not
   allowed, or if the destination mailbox is of a type that does not
   support annotations or does not support storing of annotations (a
   mailbox that returns a "NONE" or "READ-ONLY" response code in its
   ANNOTATIONS response), or if the destination mailbox cannot support
   the size of a annotation because it exceeds the ANNOTATIONS value.
   Servers MUST NOT copy ".priv" annotation data for users other than
   the current user.





Daboo & Gellens           Expires May 25, 2006                 [Page 21]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


4.7.  ANNOTATION Message Data Item in APPEND

   ANNOTATION <parenthesised entry-attribute-value list>

      Sets the specified list of entries and attributes in the resulting
      message.

   The APPEND command can include annotations for the message being
   appended via the addition of a new append data item [I-D.melnikov-
   imap-ext-abnf].  The new data item can also be used with the multi-
   append [RFC3502] extension that allows multiple messages to be
   appended via a single APPEND command.

   Example:

           C: a APPEND drafts ANNOTATION (/comment
                (value.priv "Don't send until I say so")) {310}
           S: + Ready for literal data
           C: MIME-Version: 1.0
           ...
           C:
           S: a OK APPEND completed

      In the above example, a comment with a private value is added to a
      new message appended to the mailbox.  The ellipsis represents the
      bulk of the message.

4.8.  ANNOTATION Criterion in SEARCH

   ANNOTATION <entry-name> <attribute-name> <value>

   The ANNOTATION criterion for the SEARCH command allows a client to
   search for a specified string in the value of an annotation entry of
   a message.

   Messages that have annotations with entries matching <entry-name> and
   attributes matching <attribute-name> and the specified string <value>
   in their values are returned in the SEARCH results.  The "*"
   character can be used in the entry name field to match any content in
   those items.  The "%" character can be used in the entry name field
   to match a single level of hierarchy only.

   Only the "value", "value.priv" and "value.shared" attributes can be
   searched.  Clients MUST NOT specify an attribute other than either
   "value", "value.priv" or "value.shared".  Servers MUST return a BAD
   response if the client tries to search any other attribute.

   Example:



Daboo & Gellens           Expires May 25, 2006                 [Page 22]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


           C: a SEARCH ANNOTATION /comment value "IMAP4"
           S: * SEARCH 2 3 5 7 11 13 17 19 23
           S: a OK Search complete

      In the above example, the message numbers of any messages
      containing the string "IMAP4" in the shared or private "value"
      attribute of the "/comment" entry are returned in the search
      results.

   Example:

           C: a SEARCH ANNOTATION * value.priv "IMAP4"
           S: * SEARCH 1 2 3 5 8 13 21 34
           S: a OK Search complete

      In the above example, the message numbers of any messages
      containing the string "IMAP4" in the private "value" attribute of
      any entry are returned in the search results.

4.9.  ANNOTATION Key in SORT

   ANNOTATION <entry-name> <attribute-name>

   The ANNOTATION criterion for the SORT command [I-D.ietf-imapext-sort]
   instructs the server to return the message numbers or UIDs of a
   mailbox, sorted using the values of the specified annotations.  The
   ANNOTATION criterion is available if the server returns both ANNOTATE
   and SORT as supported capabilities in the CAPABILITY command
   response.

   Messages are sorted using the values of the <attribute-name>
   attributes in the <entry-name> entries.

   Clients MUST provide either the ".priv" or ".shared" suffix to the
   attribute name to ensure that the server knows which specific value
   to sort on.

   Only the "value.priv", "value.shared", "size.priv" and "size.shared"
   attributes can be used for sorting.  Clients MUST NOT specify an
   attribute other than either "value.priv", "value.shared", "size.priv"
   or "size.shared".  Servers MUST return a BAD response if the client
   tries to search any other attribute.

   When either "value.priv" or "value.shared" is being sorted, the
   server MUST use the character set value specified in the SORT command
   to determine the appropriate sort order.

   When either "size.priv" or "size.shared" is being sorted, the server



Daboo & Gellens           Expires May 25, 2006                 [Page 23]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


   sorts using the numeric values of those attributes, as it would when
   the "SIZE" sort key is used.

   Example:

           C: a SORT (ANNOTATION /altsubject value.shared) UTF-8 ALL
           S: * SORT 2 3 4 5 1 11 10 6 7 9 8
           S: a OK Sort complete

      In the above example, the message numbers of all messages are
      returned, sorted according to the shared "value" attribute of the
      "/altsubject" entry.

   Note that the ANNOTATION sort key must include a fully specified
   entry - wild cards are not allowed.

4.10.  New ACL Rights

   As discussed in Section 3.4 this extension adds a new "n" right to
   the list of rights provided by the ACL extensions [RFC2086] and
   [I-D.ietf-imapext-2086upd].


5.  Formal Syntax

   The following syntax specification uses the Augmented Backus-Naur
   Form (ABNF) notation as specified in [RFC2234].

   Non-terminals referenced but not defined below are as defined by
   [RFC3501] with the new definitions in [I-D.melnikov-imap-ext-abnf]
   superseding those in [RFC3501].

   Except as noted otherwise, all alphabetic characters are case-
   insensitive.  The use of upper or lower case characters to define
   token strings is for editorial clarity only.  Implementations MUST
   accept these strings in a case-insensitive fashion.

      ann-size          = "NONE" /
                           (("READ-ONLY" / nz-size)
                            [SP "NOPRIVATE"])
                           ; response codes indicating the level of
                           ; support for annotations in a mailbox

      append-ext        =/ att-annotate
                          ; modifies [RFC3501] extension behaviour

      att-annotate      = "ANNOTATION" SP
                               "(" entry-att *(SP entry-att) ")"



Daboo & Gellens           Expires May 25, 2006                 [Page 24]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


      att-search        = "value" / "value.priv" / "value.shared"
                          ; the only attributes that can be searched

      att-sort          = "value.priv" / "value.shared" /
                          "size.priv" / "size.shared"
                          ; the only attributes that can be sorted

      att-value         = attrib SP value

      attrib            = astring
                          ; dot-separated attribute name
                          ; MUST NOT contain "*" or "%"

      attribs           = attrib / "(" attrib *(SP attrib) ")"
                          ; one or more attribute specifiers

      capability        =/ "ANNOTATE"
                          ; defines the capability for this extension

      entries           = entry-match /
                          "(" entry-match *(SP entry-match) ")"

      entry             = astring
                          ; slash-separated path to entry
                          ; MUST NOT contain "*" or "%"

      entry-att         = entry SP "(" att-value *(SP att-value) ")"

      entry-match       = list-mailbox
                          ; slash-separated path to entry
                          ; MAY contain "*" or "%" for use as wild cards

      fetch-att         =/ "ANNOTATION" SP "(" entries SP attribs ")"
                          ; modifies original IMAP fetch-att

      msg-att-dynamic   =/ "ANNOTATION" SP
                             ( "(" entry-att *(SP entry-att) ")" /
                               "(" entry *(SP entry) ")" )
                          ; extends FETCH response with annotation data

      resp-text-code    =/ "ANNOTATE" SP "TOOBIG" /
                           "ANNOTATE" SP "TOOMANY" /
                           "ANNOTATIONS" SP ann-size
                          ; new response codes

      search-key        =/ "ANNOTATION" SP entry-match SP att-search
                           SP value
                          ; modifies original IMAP search-key



Daboo & Gellens           Expires May 25, 2006                 [Page 25]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


      select-param      =/ "ANNOTATE"
                          ; defines the select parameter used with
                          ; ANNOTATE extension

      sort-key          =/ "ANNOTATION" SP entry SP att-sort
                          ; modifies original sort-key

      store-att-flags   =/ att-annotate
                          ; modifies original IMAP STORE command

      value             = nstring / literal8



6.  IANA Considerations

   Entry names MUST be specified in a standards track or IESG approved
   experimental RFC, or fall under the vendor namespace.  Vendor names
   MUST be registered.

   Attribute names MUST be specified in a standards track or IESG
   approved experimental RFC.

   Each entry registration MUST include a content-type that is used to
   indicate the nature of the annotation value.  Where applicable a
   charset parameter MUST be included with the content-type.

6.1.  Entry and Attribute Registration Template

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [] Entry        [] Attribute

       Name: ______________________________

       Description: _______________________

       ____________________________________

       ____________________________________

       Content-Type:_______________________

       Contact person: ____________________




Daboo & Gellens           Expires May 25, 2006                 [Page 26]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


               email:  ____________________

6.2.  Entry Registrations

   The following templates specify the IANA registrations of annotation
   entries specified in this document.

6.2.1.  /comment

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [X] Entry        [] Attribute

       Name: /comment

       Description: Defined in IMAP ANNOTATE extension document.

       Content-Type: text/plain; charset=utf-8

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name

6.2.2.  /flags

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [X] Entry        [] Attribute

       Name: /flags

       Description: Reserved entry hierarchy.

       Content-Type: -

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name







Daboo & Gellens           Expires May 25, 2006                 [Page 27]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


6.2.3.  /altsubject

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [X] Entry        [] Attribute

       Name: /altsubject

       Description: Defined in IMAP ANNOTATE extension document.

       Content-Type: text/plain; charset=utf-8

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name

6.2.4.  /<section-part>/comment

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [X] Entry        [] Attribute

       Name: /<section-part>/comment

       Description: Defined in IMAP ANNOTATE extension document.

       Content-Type: text/plain; charset=utf-8

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name














Daboo & Gellens           Expires May 25, 2006                 [Page 28]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


6.2.5.  /<section-part>/flags/seen

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [X] Entry        [] Attribute

       Name: /<section-part>/flags/seen

       Description: Defined in IMAP ANNOTATE extension document.

       Content-Type: text/plain; charset=utf-8

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name

6.2.6.  /<section-part>/flags/answered

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [X] Entry        [] Attribute

       Name: /<section-part>/flags/answered

       Description: Defined in IMAP ANNOTATE extension document.

       Content-Type: text/plain; charset=utf-8

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name














Daboo & Gellens           Expires May 25, 2006                 [Page 29]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


6.2.7.  /<section-part>/flags/flagged

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [X] Entry        [] Attribute

       Name: /<section-part>/flags/flagged

       Description: Defined in IMAP ANNOTATE extension document.

       Content-Type: text/plain; charset=utf-8

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name

6.2.8.  /<section-part>/flags/forwarded

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [X] Entry        [] Attribute

       Name: /<section-part>/flags/forwarded

       Description: Defined in IMAP ANNOTATE extension document.

       Content-Type: text/plain; charset=utf-8

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name

6.3.  Attribute Registrations

   The following templates specify the IANA registrations of annotation
   attributes specified in this document.









Daboo & Gellens           Expires May 25, 2006                 [Page 30]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


6.3.1.  value

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [] Entry        [X] Attribute

       Name: value

       Description: Defined in IMAP ANNOTATE extension document.

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name

6.3.2.  size

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [] Entry        [X] Attribute

       Name: size

       Description: Defined in IMAP ANNOTATE extension document.

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name


















Daboo & Gellens           Expires May 25, 2006                 [Page 31]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


6.3.3.  content-language

       To: iana@iana.org
       Subject: IMAP Annotate Registration

       Please register the following IMAP Annotate item:

       [] Entry        [X] Attribute

       Name: content-language

       Description: Defined in IMAP ANNOTATE extension document.

       Contact person: Cyrus Daboo

               email:  cyrus@daboo.name


7.  Internationalization Considerations

   Annotations may contain values that include text strings, and both
   searching and sorting are possible with annotations.  Servers MUST
   follow standard IMAP text normalization, character set conversion and
   collation rules when such operations are acarried out, as they would
   for other textual fields being searched or sorted on.


8.  Security Considerations

   Annotations whose values are intended to remain private MUST be
   stored in ".priv" values, and not ".shared" values which may be
   accessible to other users.

   Excluding the above issues the ANNOTATE extension does not raise any
   security considerations that are not present in the base IMAP
   protocol, and these issues are discussed in [RFC3501].


9.  References

9.1.  Normative References

   [I-D.ietf-imapext-2086upd]
              Melnikov, A., "IMAP4 ACL extension",
              draft-ietf-imapext-2086upd-08 (work in progress),
              June 2005.

   [I-D.ietf-imapext-sort]



Daboo & Gellens           Expires May 25, 2006                 [Page 32]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


              Crispin, M. and K. Murchison, "INTERNET MESSAGE ACCESS
              PROTOCOL - SORT AND THREAD EXTENSION",
              draft-ietf-imapext-sort-17 (work in progress), May 2004.

   [I-D.melnikov-imap-ext-abnf]
              Daboo, C. and A. Melnikov, "Collected extensions to IMAP4
              ABNF", draft-melnikov-imap-ext-abnf-05 (work in progress),
              October 2005.

   [RFC2086]  Myers, J., "IMAP4 ACL extension", RFC 2086, January 1997.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2234]  Crocker, D., Ed. and P. Overell, "Augmented BNF for Syntax
              Specifications: ABNF", RFC 2234, November 1997.

   [RFC2244]  Newman, C. and J. Myers, "ACAP -- Application
              Configuration Access Protocol", RFC 2244, November 1997.

   [RFC3282]  Alvestrand, H., "Content Language Headers", RFC 3282,
              May 2002.

   [RFC3501]  Crispin, M., "INTERNET MESSAGE ACCESS PROTOCOL - VERSION
              4rev1", RFC 3501, March 2003.

   [RFC3502]  Crispin, M., "Internet Message Access Protocol (IMAP) -
              MULTIAPPEND Extension", RFC 3502, March 2003.

   [RFC3629]  Yergeau, F., "UTF-8, a transformation format of ISO
              10646", STD 63, RFC 3629, November 2003.

9.2.  Informative References

   [I-D.ietf-imapext-condstore]
              Melnikov, A. and S. Hole, "IMAP Extension for Conditional
              STORE operation", draft-ietf-imapext-condstore-06 (work in
              progress), October 2005.


Appendix A.  Acknowledgments

   Many thanks to Chris Newman for his detailed comments on the first
   draft of this document, and to the participants at the ACAP working
   dinner in Pittsburgh.  The participants of the IMAPext working group
   made significant contributions to this work.





Daboo & Gellens           Expires May 25, 2006                 [Page 33]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


Authors' Addresses

   Cyrus Daboo

   Email: cyrus@daboo.name


   Randall Gellens
   QUALCOMM Incorporated
   5775 Morehouse Dr.
   San Diego, CA  92121-2779
   US

   Email: randy@qualcomm.com





































Daboo & Gellens           Expires May 25, 2006                 [Page 34]

Internet-Draft           IMAP ANNOTATE Extension           November 2005


Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Disclaimer of Validity

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Copyright Statement

   Copyright (C) The Internet Society (2005).  This document is subject
   to the rights, licenses and restrictions contained in BCP 78, and
   except as set forth therein, the authors retain all their rights.


Acknowledgment

   Funding for the RFC Editor function is currently provided by the
   Internet Society.




Daboo & Gellens           Expires May 25, 2006                 [Page 35]

